TESTE_FUNCIONAL_10032025-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: TESTE FUNCIONAL 10032025-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: TESTE FUNCIONAL 10032025-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  TESTE FUNCIONAL 10032025-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1440,731)
      - go(https://blazedemo.com/index.php)
      - waitForName(fromPort): "Clickable"
      - clickByName(fromPort)
      - waitForName(fromPort): "Clickable"
      - selectByName(fromPort): "Boston"
      - waitForName(toPort): "Clickable"
      - clickByName(toPort)
      - waitForName(toPort): "Clickable"
      - selectByName(toPort): "Rome"
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)
      - 'waitForCSS(tr:nth-of-type(5) .btn)': "Clickable"
      - 'clickByCSS(tr:nth-of-type(5) .btn)'
      - waitForID(inputName): "Clickable"
      - clickByID(inputName)
      - waitForID(inputName): "Clickable"
      - typeByID(inputName): "Vinicius Jesus"
      - waitForID(address): "Clickable"
      - clickByID(address)
      - waitForID(address): "Clickable"
      - typeByID(address): "Rua das rosas 89"
      - waitForID(city): "Clickable"
      - clickByID(city)
      - waitForID(city): "Clickable"
      - typeByID(city): "Sao Paulo"
      - waitForID(state): "Clickable"
      - clickByID(state)
      - waitForID(state): "Clickable"
      - typeByID(state): "Sao Paulo"
      - waitForID(zipCode): "Clickable"
      - clickByID(zipCode)
      - waitForID(zipCode): "Clickable"
      - typeByID(zipCode): "00982"
      - waitForID(cardType): "Clickable"
      - clickByID(cardType)
      - waitForID(cardType): "Clickable"
      - selectByID(cardType): "American Express"
      - waitForID(creditCardNumber): "Clickable"
      - clickByID(creditCardNumber)
      - waitForID(creditCardNumber): "Clickable"
      - typeByID(creditCardNumber): "154654575"
      - waitForID(nameOnCard): "Clickable"
      - clickByID(nameOnCard)
      - waitForID(nameOnCard): "Clickable"
      - typeByID(nameOnCard): "VINICIUS V S JESUS"
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)
      - waitForLinkText(Travel The World): "Clickable"
      - clickByLinkText(Travel The World)

  TESTE FUNCIONAL 10032025-Http:
    headers:
      sec-ch-ua: '"Chromium";v="134", "Not:A-Brand";v="24", "Google Chrome";v="134"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/134.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      sec-ch-ua-arch: '"x86"'
      sec-ch-ua-platform-version: '"19.0.0"'
      sec-ch-ua-model: '""'
      sec-ch-ua-bitness: '"64"'
      sec-ch-ua-wow64: '?0'
      sec-ch-ua-full-version-list: >-
        "Chromium";v="134.0.6998.88", "Not:A-Brand";v="24.0.0.0", "Google
        Chrome";v="134.0.6998.88"
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/reserve.php
            method: POST
            label: https://blazedemo.com/reserve.php
            think-time: 0ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              fromPort: Boston
              toPort: Rome
          - url: https://blazedemo.com/purchase.php
            method: POST
            label: https://blazedemo.com/purchase.php
            think-time: 2103ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              airline: Lufthansa
              flight: '4346'
              fromPort: Boston
              price: '233.98'
              toPort: Rome
          - url: https://blazedemo.com/confirmation.php
            method: POST
            label: https://blazedemo.com/confirmation.php
            think-time: 17064ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              _token: ''
              address: Rua das rosas 89
              cardType: amex
              city: Sao Paulo
              creditCardMonth: '11'
              creditCardNumber: '154654575'
              creditCardYear: '2017'
              inputName: Vinicius Jesus
              nameOnCard: VINICIUS V S JESUS
              state: Sao Paulo
              zipCode: '00982'
          - url: https://blazedemo.com/index.php
            method: GET
            label: https://blazedemo.com/index.php
            think-time: 3846ms
            headers: {}